/* 
 * http://projecteuler.net
 * 
 * Завдання №6
 * 
 * Сума квадратів перших десяти натуральних чисел:
 * 1^2 + 2^2 + ... + 10^2 = 385
 * квадрата сума перших десяти натуральних чисел:
 * (1 + 2 + ... + 10)^2 = 55^2 = 3025
 * Таким чином, різниця між сумою квадратів перших десяти натуральних
 * чисел і квадрата суми 3025 - 385 = 2640.
 * Знайти різницю між сумою квадратів перших ста натуральних чисел і
 * квадрата суми.
*/

#include <iostream>
using namespace std;

int SumOfSquares(int a)			// сума квадратів
{
	int res = 0;				// фінальна сума квадратів
	for (int i=1; i<=a; i++) {
		res += i*i;
	}
	return res;
}

int SquareSum(int a)			// квадрат суми
{
	int res = 0;				// сума натуральних чисел
	res = (a*(a+1))/2;			// сума перших n натуральних чисел
	//for (int i=1; i<=a; i++) {res += i;} // спосіб циклом
	return res*res;
}

int main()
{
	int nux = 100;				// кількість натуральних чисел
	cout << "Різниця: " << SquareSum(nux) - SumOfSquares(nux) << endl;
}

/*
 * Різниця: 25164150
 * 
 * real	0m0.002s
*/
