/* 
 * http://projecteuler.net
 * 
 * Завдання №9
 * 
 * Трійка Піфагора - три натуральних числа a < b < c, для яких
 * виконується рівняння: a^(2) + b^(2) = c^(2)
 * 
 * Наприклад: 3^(2) + 4^(2) = 9 + 16 = 25 = 5^(2).
 * Існує лише одна трійка Піфагора, для якої a + b + c = 1000.
 * Знайдіть добуток abc (a*b*c).
*/

#include <iostream>
using namespace std;

int main()
{
	for (int a=1; a<333; a++) {
		for (int b=1; b<400; b++) {
			for (int c=1; c<500; c++) {
				if (a*a+b*b==c*c && (a+b+c)==1000) {
					cout << "Послідовність: " << a << ", " << b << ", " << c;
					cout << endl << "Відповідь: " << a*b*c << endl;
				}
			}
		}
	}
}

/* 
 * Послідовність: 200, 375, 425
 * Відповідь: 31875000
 * 
 * real	0m0.313s
*/
